; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-4-2)
(:domain BLOCKS)
(:objects B D C A - block)
(:INIT (CLEAR A) (CLEAR B) (CLEAR D) (ONTABLE A) (ONTABLE C)
 (ON B C) (HOLDING D))
(:goal (AND (ON A C) (ON C B) (ON B D)))
)

; plan
1. (put-down d)
   deleted: (holding d)
   added: (handempty) (ontable d)
   goals met: 0 of 3
2. (unstack b c)
   deleted: (clear b) (handempty) (on b c)
   added: (holding b) (clear c)
   goals met: 0 of 3
3. (stack b d)
   deleted: (holding b) (clear d)
   added: (clear b) (handempty) (on b d)
   goals met: 1 of 3
4. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 1 of 3
5. (stack c b)
   deleted: (holding c) (clear b)
   added: (clear c) (handempty) (on c b)
   goals met: 2 of 3
6. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 2 of 3
7. (stack a c)
   deleted: (holding a) (clear c)
   added: (clear a) (handempty) (on a c)
   goals met: 3 of 3
